reading-notes/20230326180325-free_code_camp_college_algebra_preportions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free code camp college algebra preportions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">free code camp college algebra preportions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2b0c183">Proportions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span>&#xa0;<span class="math">math</span></span></a></li>
<li><a href="#orgb5afc87">Code</a></li>
<li><a href="#org440f857">Extra problems</a>
<ul>
<li><a href="#orge74f364">Mixed Numbers</a></li>
<li><a href="#orgb9ec4bc">Representing floating points as a fraction</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org2b0c183" class="outline-2">
<h2 id="org2b0c183">Proportions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span>&#xa0;<span class="math">math</span></span></h2>
<div class="outline-text-2" id="text-org2b0c183">
<p>
Proportions are like saying 2 multiplications are equal
5/10 = 2/4
2 * 10 = 4 * 5
To solve for x you multiply what diagonal you can, then divide by the other number.
3/6 = x/4
</p>

<p>
3 x 4 = 12
12 % 6 = 2
x = 2
</p>

<p>
Proportions are mostly used to convert units
</p>

<p>
How many miles in 20 kilometers?
1mi/1.6km = /20km
20 x 1 = 20
20 / 1.6
The answer is 12 1/2 miles
</p>
</div>
</div>
<div id="outline-container-orgb5afc87" class="outline-2">
<h2 id="orgb5afc87">Code</h2>
<div class="outline-text-2" id="text-orgb5afc87">
<p>
Setup a proportion
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">n1</span> = 1
<span style="font-weight: bold; font-style: italic;">d1</span> = 2
<span style="font-weight: bold; font-style: italic;">n2</span> = 0
<span style="font-weight: bold; font-style: italic;">d2</span> = 16
<span style="font-weight: bold;">if</span> n2 == 0:
    answer = d2 * n1 / d1
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"n2 = "</span>, answer)
<span style="font-weight: bold;">if</span> d2 == 0:
    answer = n2 * d1 / n1
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"d2 = "</span>, anwser)
</pre>
</div>

<p>
We Put 0 for the number we do not know and we use 2 if statements.
</p>
</div>
</div>


<div id="outline-container-org440f857" class="outline-2">
<h2 id="org440f857">Extra problems</h2>
<div class="outline-text-2" id="text-org440f857">
</div>
<div id="outline-container-orge74f364" class="outline-3">
<h3 id="orge74f364">Mixed Numbers</h3>
<div class="outline-text-3" id="text-orge74f364">
<p>
Mixed numbers can easily be represented in python, since fractions is the same as a division.
Python Knows the order of operations.
Example is 1 2/3 + 3 4/5 - 7
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">print</span>(1 + 2/3 + 3 + 4/5 - 7)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9ec4bc" class="outline-3">
<h3 id="orgb9ec4bc">Representing floating points as a fraction</h3>
<div class="outline-text-3" id="text-orgb9ec4bc">
<p>
What if we have this floating point and we want a fraction?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">x</span> = 0.6666666
</pre>
</div>

<p>
Multiply by 10
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">x10</span> = x * 10
<span style="font-weight: bold;">print</span>(x10)
</pre>
</div>

<p>
Lets suptract the 1x from the 10x
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">x9</span> = x10 - x
<span style="font-weight: bold;">print</span>(x9)
</pre>
</div>

<p>
Anything that repeats for one digit is a factor of 9
</p>

<p>
If you get repeating 9 that would be 9/9 so 1.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
